#+TITLE: CorePics
#+property: header-args:R  :session *R:corepics* :exports both :results output :eval no-export

This is how I use R, some command line utilities, and imagemagick to get IODP core photographs in a reduced size into my scientific figures!

*** download the images so I can crop them
We create a directory where we save all the pretty large jpg images. For walvis ridge, this takes quite a while: 4 minutes and 30 seconds to download 455 files.

This is the part where you have to have bash or another shell with the cat, awk, grep, and wget utilities installed.
#+begin_src R
  dir <- "1264_corepics"
  dir.create(dir)

  # save the clean metadata to a tsv so we can use awk to work with it
  write_tsv(cm, "cm.txt")

  # download the corepics
  system("cat cm.txt | awk '{ print $11 }' | grep '^http' | wget -P 1264_corepics -i-")
#+end_src

#+RESULTS:
FINISHED --2020-11-09 12:02:14--
Total wall clock time: 5m 48s
Downloaded: 455 files, 1.2G in 4m 30s (4.57 MB/s)

